{
    "institutions" : 
    [
        {
            "name": "Институт компьютерных систем и информационной безопасности",
            "departments": 
            [
                {
                    "name" : "Кафедра информационных систем и программирования",
                    "skills" : 
                    [
                        "Знание языков программирования. Владение основами и принципами работы с языками программирования, такими как C#, Python, JavaScript, и другими, которые используются в разработке ПО.",
                        "Разработка приложений. Основы разработки десктопных и веб-приложений, включая знание технологий, таких как .NET, WinForms, WPF, ASP.NET Core",
                        "Работа с базами данных. Основы проектирования, создания и работы с реляционными и нереляционными базами данных, включая SQL, MySQL, MS SQL, NoSQL.",      
                        "Основы тестирования. Знание принципов тестирования программного обеспечения, включая написание unit-тестов для проверки качества и стабильности кода.",
                        "Основы работы с API. Знание принципов работы с API, включая создание и интеграцию RESTful сервисов.",
                        "Создание сайтов. Верстка и основы фронтенда. Основы HTML, CSS и JavaScript, знание принципов верстки и создания пользовательских интерфейсов.",
                        "Основы операционных систем и сетей. Базовые знания о работе операционных систем и сетевых технологий, необходимых для разработки и развертывания приложений.",
                        "Моделирование и проектирование информационных систем. Основы UML и других методологий для проектирования программных систем, создание моделей для планирования и разработки ПО"
                    ]
                },

                {
                    "name" : "Кафедра информатики и вычислительной техники",
                    "skills" : 
                    [
                        "Сетевые технологии и модели OSI/TCP/IP. Глубокое понимание и практическое применение моделей OSI и TCP/IP, настройка и администрирование локальных и глобальных сетей, включая маршрутизацию, коммутацию и управление сетевыми ресурсами",
                        "Конфигурирование и администрирование сетей. Настройка различных типов сетей, работа с протоколами, управление сетевой безопасностью, а также диагностика и устранение неполадок в сетевых соединениях",
                        "Операционные системы и виртуализация. Опыт работы с операционными системами на базе Unix, включая FreeBSD, а также с виртуальными машинами для развертывания и тестирования различных вычислительных сред",      
                        "Разработка и обучение нейронных сетей. Создание и обучение нейронных сетей для решения конкретных задач, понимание архитектуры нейронных сетей и использование современных библиотек для машинного обучения (например, TensorFlow, PyTorch).",
                        "Программирование на C#, Python и Java. Владение современными языками программирования для разработки приложений различного уровня сложности, включая разработку десктопных, веб- и мобильных приложений",
                        "Мобильная разработка на платформе Android. Разработка мобильных приложений с использованием Android Studio, знание архитектуры Android и умение создавать адаптивные и пользовательски ориентированные интерфейсы",
                        "Проектирование и управление базами данных. Глубокое понимание реляционных и нереляционных баз данных, проектирование структур данных, оптимизация запросов и управление большими объемами данных",
                        "Верстка и разработка пользовательских интерфейсов. Создание интуитивно понятных пользовательских интерфейсов с использованием современных инструментов веб-разработки, таких как HTML, CSS, JavaScript, а также знание принципов UI/UX дизайна"
                    ]
                },

                {
                    "name" : "Кафедра кибербезопасности и защиты информации",
                    "skills" : 
                    [
                        
                        "Протоколы TCP/IP, UDP, ICMP",
                        "Настройка и управление маршрутизаторами и коммутаторами",
                        "Работа с VPN (IPSec, SSL/TLS)",
                        "Настройка и управление межсетевыми экранами (firewalls)",
                        "Использование систем обнаружения и предотвращения вторжений (IDS/IPS)",
                        "Защита Wi-Fi сетей (WPA3, RADIUS",
                        "Основы криптографии (симметричное и асимметричное шифрование)",
                        "Протоколы шифрования (SSL/TLS, SSH)",
                        "Управление ключами и сертификатами",
                        "Использование инструментов для сканирования уязвимостей (Nessus, OpenVAS)",
                        "Проведение тестирования на проникновение (pentesting) с использованием Metasploit, Burp Suite и других инструментов",
                        "Использование SIEM-систем (Security Information and Event Management) для мониторинга и анализа событий безопасности",
                        "Умение проводить форенсические расследования и анализ логов",
                        "Безопасная разработка программного обеспечения (OWASP Top Ten)",
                        "Использование инструментов статического и динамического анализа кода",
                        "Глубокое знание Windows и Linux систем",
                        "Настройка и управление безопасностью на уровне ОС",
                        "Знание принципов безопасности в облачных сервисах (AWS, Azure, Google Cloud)",
                        "Управление идентификацией и доступом (IAM)",
                        "Основы защиты мобильных приложений и устройств",
                        "Знание угроз, связанных с мобильными платформами",
                        "Скрипты и автоматизация: Знание языков скриптов (Python, Bash, PowerShell) для автоматизации задач безопасности"
                        
                    ]
                },

                {
                    "name" : "Кафедра автоматизации производственных процессов",
                    "skills" : 
                    [
                        
                        "Программирование микроконтроллеров (Arduino, ESP8266, ESP32, Atmega и др.)",
                        "Программирование промышленных контроллеров",
                        "Разработка и изготовление умных устройств (климатические станции, системы управления установкой, дистанционная передача данных и др. Разработка комплекта документации к ним)",
                        "Разработка промышленных систем автоматизации (подбор датчиков, клапанов, исполнительных механизмов, контроллеров, разработка схем автоматизации, электрических, структурных)",
                        "Изготовление печатных плат под персональные нужды",
                        "Разработка математических моделей реальных процессов для последующей автоматизации",
                        "Программирование роботов"
                    ]
                }
            ]
        },

        {
            "name" : "Институт механики, робототехники, инженерии транспортных и технических систем",
            "departments": 
            [
                {
                    "name" : "Кафедра технологического оборудования и систем жизнеобеспечения",
                    "skills" :
                    [
                        "3D-моделирование (разработка и корректировка моделей под различные задачи)"
                    ]
                }
            ]
        }
    ]
}